In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({'fruit':['apple','banana','orange','apple','banana'],
                    'color':['red','yellow','yellow','cyan','cyan'],
                    'price':[8.5,6.8,5.6,7.8,6.4]})
df1

    fruit   color  price
0   apple     red    8.5
1  banana  yellow    6.8
2  orange  yellow    5.6
3   apple    cyan    7.8
4  banana    cyan    6.4

In [4]:
g = df1.groupby("fruit")
g

In [7]:
for a,b in g:
    print(a)
    print("-"*100)
    print(b)

apple
----------------------------------------------------------------------------------------------------
   fruit color  price
0  apple   red    8.5
3  apple  cyan    7.8
banana
----------------------------------------------------------------------------------------------------
    fruit   color  price
1  banana  yellow    6.8
4  banana    cyan    6.4
orange
----------------------------------------------------------------------------------------------------
    fruit   color  price
2  orange  yellow    5.6

In [8]:
list(g)

[('apple',
     fruit color  price
  0  apple   red    8.5
  3  apple  cyan    7.8),
 ('banana',
      fruit   color  price
  1  banana  yellow    6.8
  4  banana    cyan    6.4),
 ('orange',
      fruit   color  price
  2  orange  yellow    5.6)]

In [11]:
list(g)[0][1]

   fruit color  price
0  apple   red    8.5
3  apple  cyan    7.8

In [10]:
dict(list(g))["apple"]

   fruit color  price
0  apple   red    8.5
3  apple  cyan    7.8

In [15]:
df1 = pd.DataFrame({'fruit':['apple','banana','orange','apple','banana','apple'],
                    'color':['red','yellow','yellow','cyan','cyan','cyan'],
                    'price':[8.5,6.8,5.6,7.8,6.4,10],
                   'type':["normal","normal","normal","normal","normal","good"]})
df1

    fruit   color  price    type
0   apple     red    8.5  normal
1  banana  yellow    6.8  normal
2  orange  yellow    5.6  normal
3   apple    cyan    7.8  normal
4  banana    cyan    6.4  normal
5   apple    cyan   10.0    good

In [25]:
g = df1.groupby(by=["fruit","color"])
for a,b in g:
    print(a)
    print("-"*100)
    print(b)
    print("-"*100)

('apple', 'cyan')
----------------------------------------------------------------------------------------------------
   fruit color  price    type
3  apple  cyan    7.8  normal
5  apple  cyan   10.0    good
----------------------------------------------------------------------------------------------------
('apple', 'red')
----------------------------------------------------------------------------------------------------
   fruit color  price    type
0  apple   red    8.5  normal
----------------------------------------------------------------------------------------------------
('banana', 'cyan')
----------------------------------------------------------------------------------------------------
    fruit color  price    type
4  banana  cyan    6.4  normal
----------------------------------------------------------------------------------------------------
('banana', 'yellow')
----------------------------------------------------------------------------------------------------
    fruit   color  price    type
1  banana  yellow    6.8  normal
----------------------------------------------------------------------------------------------------
('orange', 'yellow')
----------------------------------------------------------------------------------------------------
    fruit   color  price    type
2  orange  yellow    5.6  normal
----------------------------------------------------------------------------------------------------

In [33]:
list(g["price"])

[(('apple', 'cyan'),
  3     7.8
  5    10.0
  Name: price, dtype: float64),
 (('apple', 'red'),
  0    8.5
  Name: price, dtype: float64),
 (('banana', 'cyan'),
  4    6.4
  Name: price, dtype: float64),
 (('banana', 'yellow'),
  1    6.8
  Name: price, dtype: float64),
 (('orange', 'yellow'),
  2    5.6
  Name: price, dtype: float64)]

In [34]:
g["price"].mean()

fruit   color
apple   cyan      8.9
        red       8.5
banana  cyan      6.4
        yellow    6.8
orange  yellow    5.6
Name: price, dtype: float64

In [35]:
type(g["price"].mean())

pandas.core.series.Series

In [36]:
g[["price"]].mean()

               price
fruit  color
apple  cyan      8.9
       red       8.5
banana cyan      6.4
       yellow    6.8
orange yellow    5.6

In [37]:
type(g[["price"]].mean())

pandas.core.frame.DataFrame

In [38]:
df1[["price"]].groupby(by=[df1["fruit"],df1["color"]]).mean()

               price
fruit  color
apple  cyan      8.9
       red       8.5
banana cyan      6.4
       yellow    6.8
orange yellow    5.6

In [48]:
df1.groupby("fruit")[["price"]].mean()

           price
fruit
apple   8.766667
banana  6.600000
orange  5.600000

In [52]:
df1.groupby("fruit",as_index=False)["price"].mean()

    fruit     price
0   apple  8.766667
1  banana  6.600000
2  orange  5.600000

In [56]:
def diff(arr):
    return arr.max()-arr.min()
g = df1.groupby("fruit")["price"]
diff(g)

fruit
apple     2.2
banana    0.4
orange    0.0
Name: price, dtype: float64

In [57]:
g.agg(diff)

fruit
apple     2.2
banana    0.4
orange    0.0
Name: price, dtype: float64

In [63]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Sam', 'Make', 'Tony', 'Jim', 'Nana'])
people

             a         b         c         d         e
Sam  -0.238373 -1.328085 -0.414610  0.842798 -0.722201
Make -0.497542 -0.319655 -0.198167 -0.122069  1.499487
Tony  1.577179 -2.003463 -1.122397  0.285343  1.041418
Jim  -0.123252 -0.793587 -0.087840  1.617544 -0.970178
Nana  0.821879  0.369272 -0.395789  1.462546  0.403779

In [64]:
m = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [67]:
g = people.groupby(m,axis=1)
for a,b in g:
    print(a)
    print("-"*40)
    print(b)
    print("-"*40)

blue
----------------------------------------
             c         d
Sam  -0.414610  0.842798
Make -0.198167 -0.122069
Tony -1.122397  0.285343
Jim  -0.087840  1.617544
Nana -0.395789  1.462546
----------------------------------------
red
----------------------------------------
             a         b         e
Sam  -0.238373 -1.328085 -0.722201
Make -0.497542 -0.319655  1.499487
Tony  1.577179 -2.003463  1.041418
Jim  -0.123252 -0.793587 -0.970178
Nana  0.821879  0.369272  0.403779
----------------------------------------

In [69]:
people

             a         b         c         d         e
Sam  -0.238373 -1.328085 -0.414610  0.842798 -0.722201
Make -0.497542 -0.319655 -0.198167 -0.122069  1.499487
Tony  1.577179 -2.003463 -1.122397  0.285343  1.041418
Jim  -0.123252 -0.793587 -0.087840  1.617544 -0.970178
Nana  0.821879  0.369272 -0.395789  1.462546  0.403779

In [72]:
people.groupby(len).mean()

          a         b         c         d         e
3 -0.180813 -1.060836 -0.251225  1.230171 -0.846189
4  0.633839 -0.651282 -0.572118  0.541940  0.981561

In [74]:
people.columns=["a","ab","abc","a","ab"]
people

             a        ab       abc         a        ab
Sam  -0.238373 -1.328085 -0.414610  0.842798 -0.722201
Make -0.497542 -0.319655 -0.198167 -0.122069  1.499487
Tony  1.577179 -2.003463 -1.122397  0.285343  1.041418
Jim  -0.123252 -0.793587 -0.087840  1.617544 -0.970178
Nana  0.821879  0.369272 -0.395789  1.462546  0.403779

In [76]:
g = people.groupby(len,axis=1)
for a,b in g:
    print(a)
    print("-"*40)
    print(b)
    print("-"*40)

1
----------------------------------------
             a         a
Sam  -0.238373  0.842798
Make -0.497542 -0.122069
Tony  1.577179  0.285343
Jim  -0.123252  1.617544
Nana  0.821879  1.462546
----------------------------------------
2
----------------------------------------
            ab        ab
Sam  -1.328085 -0.722201
Make -0.319655  1.499487
Tony -2.003463  1.041418
Jim  -0.793587 -0.970178
Nana  0.369272  0.403779
----------------------------------------
3
----------------------------------------
           abc
Sam  -0.414610
Make -0.198167
Tony -1.122397
Jim  -0.087840
Nana -0.395789
----------------------------------------

In [77]:
df = pd.read_csv('starbucks_store_worldwide.csv')
df.head()

,Brand,Store Number,Store Name,Ownership Type,Street Address,City,State/Province,Country,Postcode,Phone Number,Timezone,Longitude,Latitude
0,Starbucks,47370-257954,"Meritxell, 96",Licensed,"Av. Meritxell, 96",Andorra la Vella,7,AD,AD500,376818720,GMT+1:00 Europe/Andorra,1.53,42.51
1,Starbucks,22331-212325,Ajman Drive Thru,Licensed,"1 Street 69, Al Jarf",Ajman,AJ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,55.47,25.42
2,Starbucks,47089-256771,Dana Mall,Licensed,Sheikh Khalifa Bin Zayed St.,Ajman,AJ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,55.47,25.39
3,Starbucks,22126-218024,Twofour 54,Licensed,Al Salam Street,Abu Dhabi,AZ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,54.38,24.48
4,Starbucks,17127-178586,Al Ain Tower,Licensed,"Khaldiya Area, Abu Dhabi Island",Abu Dhabi,AZ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,54.54,24.51

In [94]:
g = df.groupby(["Country","State/Province"])["Longitude"].mean()
g

Country  State/Province
AD       7                   1.530000
AE       AJ                 55.470000
         AZ                 54.804583
         DU                 55.232317
         FU                 56.315000
                              ...
US       WV                -80.890400
         WY               -106.643043
VN       HN                105.825000
         SG                106.694211
ZA       GT                 28.143333
Name: Longitude, Length: 545, dtype: float64

In [95]:
g = df.groupby(["Country","State/Province"],as_index=False)["Longitude"].mean()
g

    Country State/Province   Longitude
0        AD              7    1.530000
1        AE             AJ   55.470000
2        AE             AZ   54.804583
3        AE             DU   55.232317
4        AE             FU   56.315000
..      ...            ...         ...
540      US             WV  -80.890400
541      US             WY -106.643043
542      VN             HN  105.825000
543      VN             SG  106.694211
544      ZA             GT   28.143333

[545 rows x 3 columns]

In [100]:
g = df.groupby(["Country","State/Province"])